---
kind: type
id: T:Autodesk.Revit.DB.ElementIdParameterValue
source: html/7de25c99-4f85-ef1d-7f64-74092f963c98.htm
---
# Autodesk.Revit.DB.ElementIdParameterValue

A class that holds a ElementId value of a parameter element.

## Syntax (C#)
```csharp
public class ElementIdParameterValue : ParameterValue
```